# print("결과값 : %d" % 10)
# print("결과값 : %d, 결과값 : %d" % (10+5, 10-5))


# 문자와 숫자가 함께 출력이 안되는데 format을 사용하면 함께 출력 가능함
# print("결과값 : {:d}".format(10)) #:d 는 생략 가능함
# print("결과값 : {}".format(10))
# print("결과값 : {}, 소수점 : {:f}".format(10,5.123))
# print("{}년 {}월 {}일".format(1998,4,5))

# print("곱하기 : {}".format(3241*2134))


# 10+3, 10-3, 10+3, 10/3
# f = float

# print("덧셈 : {}, 뺄셈 : {}, 곱셈 : {}, 나눗셈 :{:010.3f}".format(10+3, 10-3, 10*3, 10/3))
# :.2f = 소수점 둘째자리까지만 내보내라
# :10.2f = 총 10자리 중 소수점 2자리까지 출력
# :010.2f = 빈 공백을 0으로 채워 줌.
# print("번호 : 011")
# print("{:03d}".format(10))# 앞의 공백을 0으로 채움
# print("{:3d}".format(11)) # 앞의 공백


# print("{:03d}".format(9876543210))# 숫자가 크면 일단 정수의 수는 다 채워짐

# 20*3, 20/3 나눗셈은 소수점2자리 까지 출력

print("곱셈 : {} 나눗셈 : {:.1f}".format(20*3, 20/3))


print("{},{:.3f}".format(352*134, 114/22))

