# # 주석 : #을 붙이면 됨. 주석은 설명문임. # 한꺼번에 주석 처리는 지정하는 줄을 드래그 후 Ctrl + /를 입력
# # # print() : 출력명령문, 사칙연산까지 가능함.
# print("안녕하세요.")
# print(1+1) # 수식을 계산함 

# # ""따옴표를 안넣으면 계산을 해주고 넣으면 계산을 해주지 않는다
# print("1+1") # 수식을 계산하지 않고 있는 그대로 출력
# # print(안녕) # 문자는 항상 ""(따옴표)를 넣어야 함. 
# print("결과값 : 1+1") # 문자, 숫자가 함께 출력은 안됨
# print("결과값 : %d" % (1+1)) # 문자와 숫자를 한꺼번에 출력을 하려고 하면

# # ★*****타입별 출력방법 (꼭 외워두기)★★★★★★★★★
# print("%d" % 1)        # %d : 정수  # 이 값은 1이 나온다
# print("%f" % 1.5)      # %f : 실수  
# print("%s" % "안녕")    # %s : 문자열


# print("%d" % 1.5) # 실수를 %d인 정수로 나타내면 "1" 정수 부분은 나옴 소숫점은 안나옴
# print("%f" % 1) # 정수를 %f 인 실수로 나타내면 "1.0000" 소숫점도 포함하여 나타냄 #정수, 실수 -> 숫자형 1.0 = 1
# #print("%d" % "안녕") # 숫자열에 문자열을 넣으면 에러가뜸
# print("%s" % 1) # 문자열에 숫자열을 넣으면 에러는 안뜨고 그냥 답이 안나옴 
# print("%s" % 1.5) # 문자타입에 숫자를 넣으면 가능

# print("%d %d" % (100,200)) 

# # 따라서 문자열 > 실수 > 정수 로 이루어진다


#print("결과값 : 5")
#print("결과값 : 2+3")
# print("결과값 : "+2+3) 출력이 안됨
#print("결과값 : %d" % (2+3)) # 이렇게 사용하면 5가 출력이 됨

# ex) 100+200+300
# 용돈 : 600원 
#print("용돈 : %d" % (100+200+300))



# 10+5 = 15, 10-5 = 5
# (10+5), (10-5)
#print("10+5=%d, 10-5=%d" % (10+5, 10-5))

#년도 :2026년, 월 : 8월
#2026, 8
# print("" %(2026, 8))
print("년도 : %d년, 해당월 : %d월" % (2026,8))
