str1 = "안녕" # 문자열
int1 = 1 # 숫자-정수형
float1 = 1.1 # 숫자-실수형
bool1 = True # 불형

# 리스트 - 모든타입이 들어올수 있음(리스트안에 리스트가능)
arr = [str1,int1,float1,bool1,[1,2,3,"안녕"]]

# 자료형 확인 - type()
print(type(float1))

## 타입변환
str2 ="111"
print(type(str2))
print(type(int(str2))) # 문자열을 정수타입으로 변경
# int() - 정수타입변환, floar() - 실수, str() - 문자열, bool() - 불타임

# 문자열 선언 - "",''

# ""를 출력하고 싶을때 \(역슬레쉬)를 넣으면 뒤에 있는 것을 문자로 인식
# print("안녕 나는 \"홍길동\"이라고해")
# print("안녕 나는 '홍길동'이라고해")
# print('안녕 나는 "홍길동"이라고해')


# # \t: 탭, \n:줄바꿈
# print("안\t녕\n하세여")

# #문자열_  +:연결 연산자, *:반복
# print("안녕"+"하세요")
# # print("안녕"+2) #srt타입+int타입의 합은 에러
# print("안녕"*10) # 반복


# # 문자 슬라이싱
# str1 = "안녕하세요"
# print(str1[1]) # '녕' 출력


# # [시작:끝:간격]
# print(str1[::-1]) # 요세하녕안 # 반대로 출력
# print(str1[:-1]) # 안녕하세   # 제일 뒤에빼고 출력
# print(str1[::2]) # 안하요    # 2칸씩 띄어서 출력

# print(str1[10]) # 에러남 10번째 인덱스가 없어서.

print(len(str1))