# Quiz
# 758.12345678 소수점 2자리까지 출력하시오
# print("{:.2f}".format(758.12345678))

# 제곱근
# 사칙연산(+, -, *, %)
# print(2**3) # 제곱근은 **(제곱)으로 나타냄

# print("문자"*3) # 반복 - 파이썬에서만 가능, c, java에선 안됨.

# Quiz
# 2. 25.05 총 10자리, 빈칸은 0으로 채워 소수점 2자리 까지 출력하시오
# print("{:010.2f}".format(25.05))

# # 3. 변수 150.15를 정수 실수 문자열로 출력하시오
# print("정수 : {} 실수 : {:.2f} 문자열 : {:s}".format(150.15,150.15,"150.15"))
# print("정수 : (%d) 실수 : (%f) 문자열 : (%s)" % (150.15,150.15,150.15))


# # 4. *을 10개 출력하시오
# print("*"*10)

#\n : 출력때 줄바꿈을 해줌. \t : tab키
# print(" 안녕하세요.\n 반갑습니다.\n 다음에 또 봐요.")
# print("안녕하세요.\t 반갑습니다.\t 다음에 또 봐요.")

# 파이썬 소스에서 줄바꿈할때 \ 를 넣어야 함.
# print("안녕하세요." \
# "잘있어요." \
# "다시 만나요")


# print("덧셈:{}, 뺄셈:{}, 곱셈:{}, 나눗셈:{}".\
#       format(10+3, 10-3, 10*3, 10%3))



# print("10+5={}, 10-5={}".format(10+5, 10-5))


# print("안녕하세요. 제 이름은 \"윤건희\"입니다") #\" 역슬래시 뒤 표기는 역슬래쉬 뒤에 문자를 문구 안에 넣어서 사용하겠다는 뜻
# print('안녕하세요. 제 이름은 "윤건희"입니다') # 홑따옴표와 쌍따옴표를 병행하며 사용가능




# 여러줄 출력은 """ 3번 사용하면 여러줄 출력이 가능  = 파이썬만 사용 가능함
# print("""\
# 안녕하세요.
# 반갑습니다.
# 다음에 봐요.
# 잘있어요.
# 다시 만나요.\
# """)



